/* ====================================================================== */
/* Auth Dialog */

/* ---------------------------------------------------------------------- */
/* Window Titles */
"ENTER_CREDENTIALS" = "Enter Credentials";
"CONNECT_TO_SERVER" = "Connect to Server";
"PRINTER_AUTH" = "Printer Authentication";
"SCREEN_SHARE_AUTH" = "Share Screen";

/* ---------------------------------------------------------------------- */
/* Auth Dialog Messages */

/* Generic Connect */
"GENERIC_MSG_BOTH" = "Enter your name and password to connect to “%@”.";
"GENERIC_MSG_PASS" = "Enter your password to connect to “%@”.";
"GENERIC_MSG_NONAME" = "Enter your user name and password.";

/* Protocol Specific */
"AFP_MSG" = "Enter your name and password for the server “%@”.";
"SMB_MSG" = "Enter your name and password for the server “%@”.";
"FTP_MSG" = "Enter your name and password for the server “%@”.";
"WEBDAV_MSG" = "Enter your name and password for the server “%@”.";

/* File Server */
"FS_MSG_BOTH" = "Enter your name and password for the server “%@”.";
"FS_MSG_PASS" = "Enter your password for the server “%@”.";

/* Generic Server */
"SRV_MSG_BOTH" = "Enter your name and password for the server “%@”.";
"SRV_MSG_PASS" = "Enter your password for the server “%@”.";

/* Printer */
"PRINT_MSG_BOTH" = "Enter your name and password for the printer “%@”.";
"PRINT_MSG_PASS" = "Enter your password for the printer “%@”.";

/* Print Server */
"PS_MSG_BOTH" = "Enter your user name and password for the print server “%@”.";
"PS_MSG_PASS" = "Enter your user name and password for the print server “%@”.";

/* Screen Sharing */
"SS_MSG_BOTH" = "Enter your name and password to share the screen of “%@”.";
"SS_MSG_PASS" = "Enter your password to share the screen of “%@”.";

"VS_MSG_BOTH" = "Enter your name and password to view the screen of “%@”.";
"VS_MSG_PASS" = "Enter your password to view the screen of “%@”.";

/* Time Machine */
"TM_MSG_BOTH" = "Enter your name and password for the server “%@” so that Time Machine can access it.";
"TM_MSG_PASS" = "Enter your password for the server “%@” so that Time Machine can access it.";

/* Pre Auth */
"PA_MSG_BOTH" = "Enter your name and password for the proxy server “%@”.";
"PA_MSG_PASS" = "Enter your password for the proxy server “%@”.";


/* ---------------------------------------------------------------------- */
/* Auth Dialog Buttons */
"CONNECT" = "Connect";
"SHARE" = "Share";
"PRINT" = "Print";
"VIEW" = "View";
"OK" = "OK";

"CONNECT_AS" = "Connect As:";
"GUEST" = "Guest";
"REGISTERED_USER" = "Registered User";

"CONNECT_BY" = "Connect:";
"BY_ASKING_FOR_PERMISSION" = "By asking for permission";
"AS_REGISTERED_USER" = "As a registered user";


/* ---------------------------------------------------------------------- */
/* Tool Tips */
"TOOLTIP_NAME_SMB" = "Domain\\Username";

/* ====================================================================== */
/* Share Picker Messages */
"SELECT_VOLUME_ON_SERVER" = "Select the volumes you want to mount on “%@”:";
"SELECT_VOLUME" = "Select the volumes to mount:";

"SELECT_PRINTER_ON_SERVER" = "Select the printer on “%@”:";

/* ---------------------------------------------------------------------- */
/* default western encoding name */
"WESTERN_MAC" = "Western (Mac)";


/* ====================================================================== */
/* Change Password */
"CHANGE_PASSWORD_MSG" = "Change the password for “%1$@” on “%2$@”.";


/* ====================================================================== */
/* Progress Dialog */
"CONNECTING_TO_GENERIC" = "Connecting…";
"CONNECTING_TO_HOST" = "Connecting to “%@”.";


/* ====================================================================== */
/* Volume Password */
"ENTER_VOLUME_PASSWORD_FOR_SERVER" = "Enter the password for “%@”, on the file server “%@”.";
"ENTER_VOLUME_PASSWORD" = "Enter the password for “%@”.";


/* ====================================================================== */
/* Keychain Kinds */
"NETWORK_PASSWORD" = "Network Password";
"PRINT_PASSWORD" = "Printer Password";
"AFP_PASSWORD" = "AFP Password";
"SMB_PASSWORD" = "SMB Password";
"FTP_PASSWORD" = "FTP Password";
"WEBDAV_PASSWORD" = "WebDAV Password";
"VNC_PASSWORD" = "VNC Password";


/* ====================================================================== */
/* ---------------------------------------------------------------------- */
/* Error Message Text */
"EMSG_OCCURRED" = "An error occurred.";
"EMSG_INVALID_PWD" = "You entered an invalid password.";
"EMSG_INVALID_NAME_PWD" = "You entered an invalid username or password.";
"EMSG_PWD_EXPIRED" = "Your password has expired.";
"EMSG_PWD_NEEDS_CHANGE" = "Your password needs to be changed.";
"EMSG_PWD_POLICY" = "Your password does not meet the policy enforced by the server.";
"EMSG_CONNECTION_FAILED" = "Connection failed";

"EMSG_MOUNT_FAILURE" = "A volume failed to mount.";

/* ---------------------------------------------------------------------- */
/* Error Info Text */
"EINFO_TRY_AGAIN" = "Please try again.";
"EINFO_CONTACT_ADMIN" = "Contact your system administrator for more information.";

"EINFO_NO_ACCESS_USER" = "You do not have permission to access the server “%@”.";
"EINFO_NO_ACCESS_GUEST" = "The server “%@” does not allow Guest access.";
"EINFO_SAME_MACHINE" = "The server “%@” is available on your computer. Access the volumes and files locally.";
"EINFO_NO_SERVER" = "The server “%@” may not exist or it is unavailable at this time. Check the server name or IP address, check your network connection, and then try again.";
"EINFO_TOO_MANY_USERS" = "The server “%@” will not allow any additional users to log on. Try to connect again later.";
"EINFO_GENERAL" = "There was an error connecting to the server “%@”. Check the server name or IP address, and then try again.\n\nIf you are unable to resolve the problem contact your system administrator.";
"EINFO_NO_SHARES" = "There are no shares available or you are not allowed to access them on the server “%@”. Please contact your system administrator to resolve the problem.";

"EINFO_NO_ACCESS_USER_UNKNOWN" = "You do not have permission to access this server.";
"EINFO_NO_ACCESS_GUEST_UNKNOWN" = "This server does not allow Guest access.";
"EINFO_SAME_MACHINE_UNKNOWN" = "This file server is available on your computer. Access the volumes and files locally.";
"EINFO_NO_SERVER_UNKNOWN" = "The server may not exist or it is unavailable at this time. Check the server name or IP address, check your network connection, and then try again.";
"EINFO_TOO_MANY_USERS_UNKNOWN" = "This file server will not allow any additional users to log on. Try to connect again later.";
"EINFO_GENERAL_UNKNOWN" = "There was an error connecting to the server. Check the server name or IP address, and then try again.\n\nIf you are unable to resolve the problem contact your system administrator.";
"EINFO_NO_SHARES_UNKNOWN" = "There are no shares available or you are not allowed to access them on the server. Please contact your system administrator to resolve the problem.";

"EINFO_UNKNOWN_MOUNT_FAILED" = "There was an error mounting a volume.";
"EINFO_ONE_MOUNT_FAILED" = "The volume “%@” could not be mounted.";
"EINFO_MULTIPLE_MOUNTS_FAILED" = "The following volumes could not be mounted:";
